{
  "shell_title": "JUAN JOSE ALZATE OROZCO",
  "shell_menu_title": "Secciones",
  "shell_menu_light_mode": "Modo Claro",
  "shell_menu_dark_mode": "Modo Oscuro",
  "shell_menu_about_me_title": "Sobre Mí",
  "dashboard_hero_title": "Desarrollador de Videojuegos",
  "dashboard_about_me_title": "Sobre Mí",
  "dashboard_about_me_text": "He encontrado mi vocación en la programación y la creación de experiencias interactivas. Me especializo en desarrollo de videojuegos con Unity, he trabajado en la optimización de mecánicas de juego, mejora de rendimiento y diseño de interfaces intuitivas. Aplico buenas prácticas de código, metodologías ágiles y principios de diseño para garantizar eficiencia e innovación. Además, mis habilidades en modelado 3D y diseño 2D, me permiten integrar arte y programación de manera fluida.",
  "dashboard_skills_title": "Habilidades",
  "dashboard_skill_1": "Unity Engine 3D/2D",
  "dashboard_skill_2": "Programación (C#)",
  "dashboard_skill_3": "Diseño de Niveles",
  "dashboard_skill_4": "Diseño de Juegos",
  "dashboard_skill_5": "Generalista 3D",
  "dashboard_skill_6": "Generalista 2D",
  "dashboard_projects_title": "Mis Proyectos",
  "dashboard_more_info_label": "Más información",
  "dashboard_more_info_details_title": "Detalles",
  "dashboard_more_info_challenges_title": "Retos",
  "dashboard_more_info_learnings_title": "Aprendizajes",
  "dashboard_more_info_tecnologies_title": "Tecnologías",
  "dashboard_more_info_categories_title": "Categorías",
  "dashboard_more_info_close_button": "Cerrar",
  "dashboard_project_patotective_description": "Eres un pequeño detective intentando resolver el caso sobre la desaparición de tu hija, enfrenta diversos desafíos para rescatarla.",
  "dashboard_project_patotective_details": "Patotective Cuak es un juego corto donde un pato detective descubre que su hija fue secuestrada. Tendrás que interrogar a diferentes personajes en un parque para averiguar si saben algo sobre su paradero. Es un juego divertido de peleas de patos en tiempo real, no muy complejo, pero los ragdolls hacen que las peleas sean entretenidas y la historia da un giro inesperado al final.",
  "dashboard_project_patotective_challenges": "El mayor reto fue lograr que las físicas ragdoll fueran divertidas y crearan situaciones inesperadas en las peleas, además de equilibrar la simpleza del combate con la narrativa. También fue un desafío mantener la experiencia fluida y sin bugs, dado el comportamiento impredecible de los ragdolls.",
  "dashboard_project_patotective_learnings": "Aprendí a implementar físicas ragdoll en Unity y a diseñar mecánicas de combate simples pero entretenidas. También mejoré en la integración de narrativa con jugabilidad y en la optimización de juegos pequeños para que sean pulidos y divertidos.",
  "dashboard_project_jumptilltheend_description": "Tu nave fue impactada por un meteorito, ahora deberás recuperar los fragmentos de tu nave que se esparcieron por un extraño planeta.",
  "dashboard_project_jumptilltheend_details": "Jump Till The End es un juego mobile donde controlas a un pequeño alienígena similar a un slime que, tras chocar su nave con un meteorito, debe recuperar las piezas perdidas en un planeta inhóspito. El objetivo es superar diferentes niveles saltando, esquivando obstáculos y enemigos para recuperar las partes de la nave y desentrañar la historia oculta del planeta. Además, el juego cuenta con soporte multilenguaje para llegar a una audiencia global.",
  "dashboard_project_jumptilltheend_challenges": "El mayor reto fue diseñar controles de salto precisos y satisfactorios para dispositivos móviles, así como crear niveles que fueran desafiantes pero accesibles. También fue un desafío optimizar el rendimiento para distintos modelos de teléfonos y mantener una curva de dificultad equilibrada a lo largo del juego.",
  "dashboard_project_skylandsurvivor_description": "Eres el último mago en pie, con tu ingenio y tu isla voladora, deberás sobrevivir ante hordas de enemigos para restablecer tu mundo.",
  "dashboard_project_skylandsurvivor_details": "Skyland Survivor es un juego que fusiona la acción tipo Vampire Survivor con mecánicas de construcción (builder) y exploración de mazmorras al estilo Zelda. El jugador controla a un mago que debe defender su isla flotante de oleadas de enemigos, pero también puede explorar mazmorras generadas proceduralmente para conseguir planos de nuevas armas y mejoras para su base principal. El juego destaca por su sistema de progresión, la integración de varios géneros y el soporte multi lenguaje, permitiendo a jugadores de diferentes regiones disfrutar la experiencia.",
  "dashboard_project_skylandsurvivor_challenges": "El mayor reto fue equilibrar la jugabilidad entre la defensa de la base y la exploración de mazmorras, asegurando que ambas mecánicas fueran igual de atractivas. Implementar mapas procedurales y un sistema de recompensas significativo para la exploración requirió mucha iteración. Además, optimizar el rendimiento para que los mapas grandes y la IA de los enemigos funcionaran bien en todo tipo de dispositivos fue un desafío técnico importante.",
  "dashboard_project_skylandsurvivor_learnings": "Este proyecto me permitió profundizar en la generación procedural de mapas, el diseño de sistemas de progresión y la integración de múltiples géneros en un solo juego. Mejoré mis habilidades en optimización, balanceo de dificultad y localización (multi lenguaje), así como en la creación de experiencias de usuario más ricas y rejugables.",
  "dashboard_project_echoesoftheabyss_description": "Una aventura rogelike donde tendrás que avanzar por un lugar inhóspito luego de quedar atrapado en un antiguo laberinto.",
  "dashboard_project_echoesoftheabyss_details": "Echoes of the Abyss es un tactical RPG en 2.5D con elementos rogelike, donde tras quedar atrapado en un antiguo laberinto deberás explorar sus profundidades, reunir items, mejorar tus habilidades y reclutar compañeros que también han quedado atrapados. Cada expedición es única gracias a la generación procedural de escenarios y eventos, y el jugador debe tomar decisiones estratégicas para sobrevivir y descubrir los secretos del abismo. El juego está disponible para PC y dispositivos móviles, y en ambas plataformas cuenta con adaptación para jugar con mando.",
  "dashboard_project_echoesoftheabyss_challenges": "El principal reto fue diseñar un sistema de combate táctico que resultara desafiante y satisfactorio, así como equilibrar la dificultad de la exploración rogelike con la progresión del jugador. Implementar la generación procedural de mapas y eventos, y crear una IA convincente para los aliados y enemigos, requirió mucha iteración y pruebas. Además, lograr una ambientación inmersiva en 2.5D fue un desafío artístico y técnico.",
  "dashboard_project_echoesoftheabyss_learnings": "Este proyecto me permitió profundizar en el diseño de sistemas de combate táctico, generación procedural y narrativa emergente. Aprendí sobre balanceo de dificultad, diseño de IA para compañeros y enemigos, y cómo crear una experiencia de exploración rejugable. También mejoré mis habilidades en Unity, C# y en la integración de arte 2D y 3D para lograr una estética coherente.",
  "dashboard_contact_title": "Contacto",
  "dashboard_contact_subtitle": "¿Tienes alguna pregunta o quieres colaborar?"
}