{
  "shell_title": "JUAN JOSE ALZATE OROZCO",
  "shell_menu_title": "Sections",
  "shell_menu_light_mode": "Light Mode",
  "shell_menu_dark_mode": "Dark Mode",
  "shell_menu_about_me_title": "About Me",
  "dashboard_hero_title": "Game Developer",
  "dashboard_about_me_title": "About Me",
  "dashboard_about_me_text": "I have found my vocation in programming and creating interactive experiences. I specialize in game development with Unity, have worked on optimizing game mechanics, improving performance, and designing intuitive interfaces. I apply good coding practices, agile methodologies, and design principles to ensure efficiency and innovation. Additionally, my skills in 3D modeling and 2D design allow me to seamlessly integrate art and programming.",
  "dashboard_skills_title": "Skills",
  "dashboard_skill_1": "Unity Engine 3D/2D",
  "dashboard_skill_2": "Programming (C#)",
  "dashboard_skill_3": "Level Design",
  "dashboard_skill_4": "Game Design",
  "dashboard_skill_5": "3D Generalist",
  "dashboard_skill_6": "2D Generalist",
  "dashboard_projects_title": "My Projects",
  "dashboard_more_info_label": "More Information",
  "dashboard_more_info_details_title": "Details",
  "dashboard_more_info_challenges_title": "Challenges",
  "dashboard_more_info_learnings_title": "Learnings",
  "dashboard_more_info_tecnologies_title": "Technologies",
  "dashboard_more_info_categories_title": "Categories",
  "dashboard_more_info_close_button": "Close",
  "dashboard_project_patotective_description": "You are a little detective trying to solve the case of your daughter's disappearance, face various challenges to rescue her.",
  "dashboard_project_patotective_details": "Patotective Cuak is a short game where a detective duck discovers that his daughter has been kidnapped. You will have to interrogate different characters in a park to find out if they know anything about her whereabouts. It is a fun real-time duck fighting game, not very complex, but the ragdolls make the fights entertaining and the story takes an unexpected turn at the end.",
  "dashboard_project_patotective_challenges": "The biggest challenge was to make the ragdoll physics fun and create unexpected situations in the fights, as well as balancing the simplicity of the combat with the narrative. It was also a challenge to keep the experience smooth and bug-free, given the unpredictable behavior of the ragdolls.",
  "dashboard_project_patotective_learnings": "I learned to implement ragdoll physics in Unity and to design simple but entertaining combat mechanics. I also improved in integrating narrative with gameplay and in optimizing small games to make them polished and fun.",
  "dashboard_project_jumptilltheend_description": "Your ship was hit by a meteorite, now you must recover the fragments of your ship that scattered across a strange planet.",
  "dashboard_project_jumptilltheend_details": "Jump Till The End is a mobile game where you control a small alien similar to a slime that, after crashing his ship with a meteorite, must recover the lost pieces on an inhospitable planet. The objective is to overcome different levels by jumping, dodging obstacles and enemies to recover the parts of the ship and unravel the hidden story of the planet. In addition, the game has multi-language support to reach a global audience.",
  "dashboard_project_jumptilltheend_challenges": "The biggest challenge was designing precise and satisfying jump controls for mobile devices, as well as creating levels that were challenging yet accessible. It was also a challenge to optimize performance for different phone models and maintain a balanced difficulty curve throughout the game.",
  "dashboard_project_skylandsurvivor_description": "You are the last wizard standing, with your wits and your flying island, you must survive hordes of enemies to restore your world.",
  "dashboard_project_skylandsurvivor_details": "Skyland Survivor is a game that fuses Vampire Survivor-style action with builder mechanics and Zelda-style dungeon exploration. The player controls a wizard who must defend his floating island from waves of enemies, but can also explore procedurally generated dungeons to obtain blueprints for new weapons and upgrades for the main base. The game stands out for its progression system, the integration of multiple genres, and multi-language support, allowing players from different regions to enjoy the experience.",
  "dashboard_project_skylandsurvivor_challenges": "The biggest challenge was balancing gameplay between base defense and dungeon exploration, ensuring both mechanics were equally engaging. Implementing procedural maps and a meaningful reward system for exploration required a lot of iteration. In addition, optimizing performance so that large maps and enemy AI worked well on all types of devices was a major technical challenge.",
  "dashboard_project_skylandsurvivor_learnings": "This project allowed me to deepen my knowledge in procedural map generation, progression system design, and the integration of multiple genres in a single game. I improved my skills in optimization, difficulty balancing, and localization (multi-language), as well as in creating richer and more replayable user experiences.",
  "dashboard_project_echoesoftheabyss_description": "A roguelike adventure where you must progress through a hostile place after being trapped in an ancient labyrinth.",
  "dashboard_project_echoesoftheabyss_details": "Echoes of the Abyss is a 2.5D tactical RPG with roguelike elements, where after being trapped in an ancient labyrinth you must explore its depths, gather items, improve your skills, and recruit companions who are also trapped. Each expedition is unique thanks to the procedural generation of scenarios and events, and the player must make strategic decisions to survive and discover the secrets of the abyss. The game is available for PC and mobile devices, and on both platforms it is adapted for controller play.",
  "dashboard_project_echoesoftheabyss_challenges": "The main challenge was designing a tactical combat system that was both challenging and satisfying, as well as balancing the difficulty of roguelike exploration with player progression. Implementing procedural generation of maps and events, and creating convincing AI for allies and enemies, required a lot of iteration and testing. Additionally, achieving an immersive 2.5D atmosphere was both an artistic and technical challenge.",
  "dashboard_project_echoesoftheabyss_learnings": "This project allowed me to deepen my knowledge in tactical combat system design, procedural generation, and emergent narrative. I learned about difficulty balancing, AI design for companions and enemies, and how to create a replayable exploration experience. I also improved my skills in Unity, C#, and in integrating 2D and 3D art to achieve a coherent aesthetic.",
  "dashboard_contact_title": "Contact",
  "dashboard_contact_subtitle": "Do you have any questions or want to collaborate?"
}